rnn-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-TW" xml:lang="zh-TW">
<head>
<!-- 2017-01-19 週四 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RNN 的收斂性分析</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fatfingererr - www.ffe.tw" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">RNN 的收斂性分析</h1>
<div id="table-of-contents">
<h2>&#30446;&#37636;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd1f64c7">RNN 的收斂性質</a>
<ul>
<li><a href="#orgd177272">收斂性分析方法</a></li>
</ul>
</li>
<li><a href="#org4968bc0">Hopfield RNN</a>
<ul>
<li><a href="#org22f0160">均衡點 Equilibrium</a></li>
<li><a href="#orgb05c95e">完全穩定性 Complete Stability</a></li>
</ul>
</li>
<li><a href="#orga9633a5">Work&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></a>
<ul>
<li><a href="#orgffa695f">Marketing</a></li>
<li><a href="#org9e043a7">Operations</a></li>
<li><a href="#org1cfe13b">Travel</a></li>
</ul>
</li>
<li><a href="#orgfc003cb">Personal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="home">home</span></span></a>
<ul>
<li><a href="#org781db64">Reading</a></li>
<li><a href="#orgebc63a1">Health</a></li>
<li><a href="#org9e1289b">Finance</a></li>
<li><a href="#org7d394d5">Chores</a></li>
<li><a href="#orgc592fcd">Recreation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
  <a href="https://github.com/fatfingererr/note/blob/master/rnn-doc.org" class="fa fa-github"> GitHub</a>
</div>


$$
\frac{1}{2}
$$


<div id="outline-container-orgd1f64c7" class="outline-2">
<h2 id="orgd1f64c7">RNN 的收斂性質</h2>
<div class="outline-text-2" id="text-orgd1f64c7">
<ul class="org-ul">
<li>當你瞭解了RNN的收斂性質，你才能做出一個好的RNN應用出來</li>
<li>那什麼又是收斂性質呢？基本上RNN的收斂行為分為兩種：
<ol class="org-ol">
<li><b><b>單穩態 Monostability</b></b>
<ul class="org-ul">
<li>單穩態代表所有 RNN 的訓練過程中，網路權重最後會收斂到一組穩定的參數</li>
<li>在這個問題後續會借用 Lyapunov 的穩態理論來討論</li>
</ul></li>
<li><b><b>多穩態 Multistability</b></b>
<ul class="org-ul">
<li>單穩態的缺點在於真正日常生活中的問題，可能不存在標準答案</li>
<li>多穩態考量網路權重可能不存在特定參數，因此網路訓練過程的參數會來回震盪</li>
<li>而這些震盪可能徘徊在幾個合理參數之間，此即為多穩態</li>
</ul></li>
</ol></li>
</ul>
</div>

<div id="outline-container-orgd177272" class="outline-3">
<h3 id="orgd177272">收斂性分析方法</h3>
<div class="outline-text-3" id="text-orgd177272">
<ul class="org-ul">
<li>Lyapunov 分析法</li>
<li>不等式分析法</li>
</ul>
</div>

<div id="outline-container-org123e9fb" class="outline-4">
<h4 id="org123e9fb">能量函數分析法</h4>
<div class="outline-text-4" id="text-org123e9fb">
<ul class="org-ul">
<li>由於 RNN 和時間有關，所以可以考慮一個類神經網路的作用，就好像是一個微分方程式：</li>
</ul>

$$
\frac{dx}{dt} = f(x)
$$

<ul class="org-ul">
<li>trajectory 軌跡：指訓練過程中存在唯一路徑</li>
</ul>
</div>
</div>
</div>
</div>



<div id="outline-container-org4968bc0" class="outline-2">
<h2 id="org4968bc0">Hopfield RNN</h2>
<div class="outline-text-2" id="text-org4968bc0">
<ul class="org-ul">
<li>Hopfield 在研究類神經網路的時候，他有兩個發現：
<ul class="org-ul">
<li>神經元在模型中存在高度互聯的關係（Highly interconnected）</li>
<li>高度互聯關係會產生 <b>【集體計算性質】</b> （Collective computational roperties）</li>
<li>一種簡單的 <b>集體計算性質</b> 就是 <b>結合存儲</b> （Content addressable memory）</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Hopfield 模型被描述成如下：</li>
</ul>

$$
\left\{\begin{matrix}
C_i \frac{du_i(t)}{dt}=-\frac{u_i(t)}{R_i}+\sum_{j=1}^{n}T_ijv_i(t)+I_i\\ 
\\
v_i(t) = g_i(u_i(t))\ ,\ \ i = 1,..., n
\end{matrix}\right.
$$

<ul class="org-ul">
<li>這邊你會發現 Hopfield 提出的的模型描述起來怎麼那麼數學，而不是給你一個簡單的網路圖，看起來更接近隨機模型，這主要是與他想解決的問題有關。</li>
</ul>


<ul class="org-ul">
<li>這個模型中：
<ul class="org-ul">
<li>\(u_i\) 是神經元輸入，\(v_i\) 是神經元輸出，\(g(\cdot)\) 是神經元權重計算後帶入傳遞函數</li>
<li>這邊的 \(g(\cdot)\) 是 Sigmoid 函數</li>
<li>\(v_i\) 可以看成是短期平均神經元的活耀度</li>
<li>\(T_{ij}\) 表示了神經元 \(i\) 與神經元 \(j\) 之間的連結強度</li>
<li>\(I_i\) 為神經元 \(i\) 的外部常數輸入</li>
<li>\(C_i\) 與 \(R_i\) 都是神經元放大器（Neural amplifier）
<ul class="org-ul">
<li>\(C_i\) 為輸入電容（Input capacitance）</li>
<li>\(R_i\) 為輸入電阻（Input resistance）</li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org22f0160" class="outline-3">
<h3 id="org22f0160">均衡點 Equilibrium</h3>
<div class="outline-text-3" id="text-org22f0160">
<ul class="org-ul">
<li>什麼是均衡點呢？簡單來說就是滿足下式的 \(u^*\) ：</li>
</ul>

$$
-\frac{1}{R_i} u_i^* + \sum_{j=1}^{n} T_{ij}g_j(u_j^*)+I_i=0\ ,\ \ \ i=1,...,n
$$

<ul class="org-ul">
<li>對一個類神經網路來說，均衡點扮演兩件事情：
<ul class="org-ul">
<li>一個好的類神經網路，應該至少要有一個均衡點</li>
<li>假如類神經網路有一個以上的均衡點，這些均衡點必須孤立存在（isolated）</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb05c95e" class="outline-3">
<h3 id="orgb05c95e">完全穩定性 Complete Stability</h3>
</div>
</div>






<div id="outline-container-orga9633a5" class="outline-2">
<h2 id="orga9633a5">Work&#xa0;&#xa0;&#xa0;<span class="tag"><span class="work">work</span></span></h2>
<div class="outline-text-2" id="text-orga9633a5">
<p>
Only work tasks in this list.
</p>
</div>

<div id="outline-container-orgffa695f" class="outline-3">
<h3 id="orgffa695f">Marketing</h3>
<div class="outline-text-3" id="text-orgffa695f">
<p>
Project "Corporate Marketing".
</p>
</div>

<div id="outline-container-org4836857" class="outline-4">
<h4 id="org4836857">Background and research</h4>
<div class="outline-text-4" id="text-org4836857">
</div><div id="outline-container-orge5e550b" class="outline-5">
<h5 id="orge5e550b"><span class="todo TODO">TODO</span> Who are the competitors?</h5>
</div>

<div id="outline-container-org718d077" class="outline-5">
<h5 id="org718d077"><span class="todo TODO">TODO</span> What are our product's advantages?</h5>
</div>

<div id="outline-container-org61ef39a" class="outline-5">
<h5 id="org61ef39a"><span class="todo TODO">TODO</span> Target market</h5>
</div>

<div id="outline-container-orgdea0131" class="outline-5">
<h5 id="orgdea0131"><span class="todo TODO">TODO</span> Elevator pitch</h5>
</div>
</div>

<div id="outline-container-org9fd44d2" class="outline-4">
<h4 id="org9fd44d2">PR firm</h4>
<div class="outline-text-4" id="text-org9fd44d2">
</div><div id="outline-container-org578e048" class="outline-5">
<h5 id="org578e048"><span class="todo TODO">TODO</span> Call Laura about PR firm&#xa0;&#xa0;&#xa0;<span class="tag"><span class="phone">phone</span></span></h5>
</div>

<div id="outline-container-org9729e97" class="outline-5">
<h5 id="org9729e97"><span class="todo TODO">TODO</span> Interview PR firm candidates</h5>
<div class="outline-text-5" id="text-org9729e97">
</div>
</div>
</div>

<div id="outline-container-orgf6867ab" class="outline-4">
<h4 id="orgf6867ab">Advertising campaign</h4>
<div class="outline-text-4" id="text-orgf6867ab">
</div><div id="outline-container-org50511dd" class="outline-5">
<h5 id="org50511dd"><span class="todo TODO">TODO</span> Call Joe</h5>
<div class="outline-text-5" id="text-org50511dd">
</div>
</div>
</div>

<div id="outline-container-org03c4734" class="outline-4">
<h4 id="org03c4734">Plan conference</h4>
<div class="outline-text-4" id="text-org03c4734">
<p>
Calendar events/invitations.
</p>
</div>

<div id="outline-container-org022a287" class="outline-5">
<h5 id="org022a287"><span class="todo TODO">TODO</span> Recruit volunteers</h5>
<div class="outline-text-5" id="text-org022a287">
</div>
</div>

<div id="outline-container-org11a3fa5" class="outline-5">
<h5 id="org11a3fa5"><span class="todo TODO">TODO</span> Make sure responses are coming back</h5>
</div>
</div>
</div>

<div id="outline-container-org9e043a7" class="outline-3">
<h3 id="org9e043a7">Operations</h3>
<div class="outline-text-3" id="text-org9e043a7">
</div><div id="outline-container-orge3a488b" class="outline-4">
<h4 id="orge3a488b"><span class="todo TODO">TODO</span> Update database to latest version</h4>
<div class="outline-text-4" id="text-orge3a488b">
</div>
</div>

<div id="outline-container-org14477c8" class="outline-4">
<h4 id="org14477c8"><span class="todo TODO">TODO</span> Update Website</h4>
<div class="outline-text-4" id="text-org14477c8">
<p>
Update blog.
</p>
</div>
</div>
</div>

<div id="outline-container-org1cfe13b" class="outline-3">
<h3 id="org1cfe13b">Travel</h3>
<div class="outline-text-3" id="text-org1cfe13b">
</div><div id="outline-container-org50f3dff" class="outline-4">
<h4 id="org50f3dff">Boston</h4>
<div class="outline-text-4" id="text-org50f3dff">
</div><div id="outline-container-org38f1d93" class="outline-5">
<h5 id="org38f1d93"><span class="todo TODO">TODO</span> Find a flight</h5>
</div>

<div id="outline-container-orge2da28e" class="outline-5">
<h5 id="orge2da28e"><span class="todo TODO">TODO</span> Book hotel room</h5>
</div>

<div id="outline-container-org6013afb" class="outline-5">
<h5 id="org6013afb"><span class="todo TODO">TODO</span> Schedule meetings</h5>
</div>

<div id="outline-container-org4ebe252" class="outline-5">
<h5 id="org4ebe252"><span class="todo TODO">TODO</span> Submit expense report</h5>
<div class="outline-text-5" id="text-org4ebe252">
<hr  />
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfc003cb" class="outline-2">
<h2 id="orgfc003cb">Personal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="home">home</span></span></h2>
<div class="outline-text-2" id="text-orgfc003cb">
</div>

<div id="outline-container-org781db64" class="outline-3">
<h3 id="org781db64">Reading</h3>
<div class="outline-text-3" id="text-org781db64">
</div><div id="outline-container-org43f2e4e" class="outline-4">
<h4 id="org43f2e4e"><span class="done DONE">DONE</span> Read "Getting Things Done"</h4>
<div class="outline-text-4" id="text-org43f2e4e">
</div>
</div>
</div>

<div id="outline-container-orgebc63a1" class="outline-3">
<h3 id="orgebc63a1">Health</h3>
<div class="outline-text-3" id="text-orgebc63a1">
</div><div id="outline-container-org92cc567" class="outline-4">
<h4 id="org92cc567"><span class="todo TODO">TODO</span> Make dentist appointment</h4>
<div class="outline-text-4" id="text-org92cc567">
</div>
</div>

<div id="outline-container-org0012716" class="outline-4">
<h4 id="org0012716"><span class="todo TODO">TODO</span> Go to the gym</h4>
<div class="outline-text-4" id="text-org0012716">
<p>
It should be as natural to some as showering or eating.
</p>
</div>
</div>

<div id="outline-container-org9ca66fb" class="outline-4">
<h4 id="org9ca66fb"><span class="todo TODO">TODO</span> Do jogging</h4>
<div class="outline-text-4" id="text-org9ca66fb">
<p>
Marathon = 42.195 kilometres.
</p>
</div>
</div>
</div>

<div id="outline-container-org9e1289b" class="outline-3">
<h3 id="org9e1289b">Finance</h3>
<div class="outline-text-3" id="text-org9e1289b">
</div><div id="outline-container-org6bdd3ed" class="outline-4">
<h4 id="org6bdd3ed"><span class="todo TODO">TODO</span> Pay electricity bill&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FLAGGED">FLAGGED</span></span></h4>
</div>

<div id="outline-container-org8b2ca16" class="outline-4">
<h4 id="org8b2ca16"><span class="todo TODO">TODO</span> Renew newspaper subscription</h4>
</div>

<div id="outline-container-orge2c3256" class="outline-4">
<h4 id="orge2c3256"><span class="todo TODO">TODO</span> Cancel insurance</h4>
</div>
</div>

<div id="outline-container-org7d394d5" class="outline-3">
<h3 id="org7d394d5">Chores</h3>
<div class="outline-text-3" id="text-org7d394d5">
</div><div id="outline-container-orgba6cc32" class="outline-4">
<h4 id="orgba6cc32"><span class="todo TODO">TODO</span> Buy milk</h4>
</div>

<div id="outline-container-org2dae252" class="outline-4">
<h4 id="org2dae252"><span class="todo TODO">TODO</span> Buy dog food</h4>
</div>

<div id="outline-container-orgd68e80d" class="outline-4">
<h4 id="orgd68e80d">WAIT Mail package to Susan</h4>
</div>

<div id="outline-container-orgc2f02ea" class="outline-4">
<h4 id="orgc2f02ea"><span class="todo TODO">TODO</span> Buy groceries</h4>
</div>

<div id="outline-container-org2616d5a" class="outline-4">
<h4 id="org2616d5a"><span class="todo TODO">TODO</span> Mow the lawn</h4>
</div>

<div id="outline-container-orgd9fb311" class="outline-4">
<h4 id="orgd9fb311"><span class="todo TODO">TODO</span> Get a haircut</h4>
</div>

<div id="outline-container-org793273f" class="outline-4">
<h4 id="org793273f"><span class="todo TODO">TODO</span> Buy anniversary present</h4>
</div>

<div id="outline-container-orgf2ffa60" class="outline-4">
<h4 id="orgf2ffa60"><span class="todo TODO">TODO</span> Take out trash</h4>
</div>

<div id="outline-container-org21c8583" class="outline-4">
<h4 id="org21c8583"><span class="todo TODO">TODO</span> Get the car fixed</h4>
</div>
</div>

<div id="outline-container-orgc592fcd" class="outline-3">
<h3 id="orgc592fcd">Recreation</h3>
<div class="outline-text-3" id="text-orgc592fcd">
</div><div id="outline-container-org30a704d" class="outline-4">
<h4 id="org30a704d"><span class="todo TODO">TODO</span> Go to concert</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2015-04-28</p>
<p class="author">&#20316;&#32773;: fatfingererr - www.ffe.tw</p>
<p class="date">Created: 2017-01-19 週四 00:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
